{"backend": "tensorflow", "keras_version": "2.1.1", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "return_state": false, "trainable": true, "name": "lstm_1", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "batch_input_shape": [null, 7, 54], "stateful": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "units": 800, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "implementation": 1, "activation": "tanh", "dropout": 0.0, "unit_forget_bias": true, "unroll": false, "return_sequences": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "units": 54, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "linear"}}], "class_name": "Sequential"}