{"config": [{"config": {"kernel_regularizer": null, "recurrent_regularizer": null, "unit_forget_bias": true, "implementation": 1, "go_backwards": false, "kernel_constraint": null, "name": "lstm_1", "activity_regularizer": null, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "dtype": "float32", "units": 800, "trainable": true, "batch_input_shape": [null, 7, 54], "recurrent_dropout": 0.0, "recurrent_constraint": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "dropout": 0.0, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"rate": 0.3, "name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 54, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.1.1", "class_name": "Sequential", "backend": "tensorflow"}