{"keras_version": "2.1.1", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "name": "lstm_1", "return_state": false, "activity_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0, "use_bias": true, "implementation": 1, "stateful": false, "units": 800, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, 7, 54], "unroll": false, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.4, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 54, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "linear", "name": "activation_1"}}]}