{"keras_version": "2.1.1", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "unroll": false, "units": 800, "name": "lstm_1", "activation": "tanh", "return_state": false, "return_sequences": false, "implementation": 1, "recurrent_regularizer": null, "batch_input_shape": [null, 7, 54], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "go_backwards": false, "stateful": false, "kernel_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "units": 54, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}