{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "name": "lstm_1", "recurrent_constraint": null, "bias_constraint": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_regularizer": null, "stateful": false, "use_bias": true, "kernel_regularizer": null, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "batch_input_shape": [null, 7, 54], "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_constraint": null, "unroll": false, "units": 800, "unit_forget_bias": true, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"rate": 0.3, "seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "units": 54, "trainable": true, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}