{"config": [{"config": {"bias_constraint": null, "go_backwards": false, "activation": "tanh", "unit_forget_bias": true, "activity_regularizer": null, "return_sequences": false, "name": "lstm_1", "batch_input_shape": [null, 7, 54], "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "kernel_regularizer": null, "units": 800, "recurrent_regularizer": null, "stateful": false, "implementation": 1, "dtype": "float32", "kernel_constraint": null, "dropout": 0.0, "bias_regularizer": null, "use_bias": true, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "units": 54, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1"}