{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "return_sequences": false, "activation": "tanh", "implementation": 1, "bias_constraint": null, "kernel_regularizer": null, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "go_backwards": false, "kernel_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "name": "lstm_1", "unit_forget_bias": true, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 7, 54], "units": 800, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null, "trainable": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_state": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"units": 54, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}