{"class_name": "Sequential", "keras_version": "2.1.1", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, 7, 54], "implementation": 1, "use_bias": true, "recurrent_regularizer": null, "name": "lstm_1", "dtype": "float32", "recurrent_constraint": null, "return_state": false, "stateful": false, "unit_forget_bias": true, "return_sequences": false, "go_backwards": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "unroll": false, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "units": 800, "activation": "tanh", "dropout": 0.0, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.3, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "units": 54}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_1", "trainable": true}}]}