{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "implementation": 1, "recurrent_regularizer": null, "return_sequences": false, "batch_input_shape": [null, 7, 54], "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unroll": false, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 800, "bias_constraint": null, "return_state": false, "use_bias": true, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "go_backwards": false, "name": "lstm_1", "activation": "tanh", "trainable": true, "unit_forget_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 54, "name": "dense_1", "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}