{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1", "config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "activation": "tanh", "name": "lstm_1", "return_sequences": false, "recurrent_regularizer": null, "stateful": false, "activity_regularizer": null, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 600, "unroll": false, "dropout": 0.0, "bias_regularizer": null, "batch_input_shape": [null, 7, 54], "dtype": "float32", "use_bias": true, "return_state": false, "kernel_regularizer": null, "trainable": true, "implementation": 1, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.4}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "units": 54, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "linear"}}]}